performance/axis2/data/echoMeshInterfaceObjects-10.xml

<?xml version='1.0' encoding='utf-8'?><soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope"><soapenv:Header /><soapenv:Body><ns1:echoMeshInterfaceObjects xmlns:ns1="http://www.extreme.indiana.edu/wsdl/Benchmark1"><ns1:input><ns1:x>0</ns1:x><ns1:y>0</ns1:y><ns1:value>0.0</ns1:value></ns1:input><ns1:input><ns1:x>1</ns1:x><ns1:y>1</ns1:y><ns1:value>1.0</ns1:value></ns1:input><ns1:input><ns1:x>2</ns1:x><ns1:y>2</ns1:y><ns1:value>1.4142135623730951</ns1:value></ns1:input><ns1:input><ns1:x>3</ns1:x><ns1:y>3</ns1:y><ns1:value>1.7320508075688772</ns1:value></ns1:input><ns1:input><ns1:x>4</ns1:x><ns1:y>4</ns1:y><ns1:value>2.0</ns1:value></ns1:input><ns1:input><ns1:x>5</ns1:x><ns1:y>5</ns1:y><ns1:value>2.23606797749979</ns1:value></ns1:input><ns1:input><ns1:x>6</ns1:x><ns1:y>6</ns1:y><ns1:value>2.449489742783178</ns1:value></ns1:input><ns1:input><ns1:x>7</ns1:x><ns1:y>7</ns1:y><ns1:value>2.6457513110645907</ns1:value></ns1:input><ns1:input><ns1:x>8</ns1:x><ns1:y>8</ns1:y><ns1:value>2.8284271247461903</ns1:value></ns1:input><ns1:input><ns1:x>9</ns1:x><ns1:y>9</ns1:y><ns1:value>3.0</ns1:value></ns1:input></ns1:echoMeshInterfaceObjects></soapenv:Body></soapenv:Envelope>